/*******************************************************************************
* 文 件 名: sched_heap_2.c
* 创 建 者: Keda Huang
* 版    本: V1.0
* 创建日期: 2016-07-25
* 文件说明: 事件驱动调度器的动态内存分配 - 使用标准库的动态内存分配函数
*******************************************************************************/

#include "sched_port.h"
#include <stdlib.h>
/*******************************************************************************

                                    内存分配

*******************************************************************************/
/*内存管理初始化*/
void sched_PortHeapInit(void)
{

}

/*动态内存分配*/
void *sched_PortMalloc(size_t size)
{
void *ret = malloc(size);

    SCHED_CHECK(NULL != ret,chkSCHED_MALLOC_FAILED);
    return (ret);
}

/*动态内存释放*/
void sched_PortFree(void *pv)
{
    free(pv);
}
